attr 1 100

createtransfer 201 14 23

createnpc 101 10 8 7 1

scenename '无机阁'
return



师傅:
if 31 回去收拾下山吧
if 30 取回伏魔剑
if 2 去取剑
if 1 见师傅
say 3 '无机道人' LEFT "无机阁在三清宫的北部。"
return

见师傅:
say 1 '柳清风' LEFT "弟子拜见师父，不知师父急招弟子，有何吩咐？"
say 3 '无机道人' LEFT "哼&$#!一天到晚就知道玩，上次比武大会拿了个倒数第二，现在还不好好练功，就会给我丢脸。"
say 1 '柳清风' LEFT "师父，我不是在玩，我是在练一种我自创的功夫，我打给你看……"
say 3 '无机道人' LEFT "好了好了，听好，为师近观天象，发现山下被一股妖气弥绕，且有渐浓之势，本想你下山去看看。"
say 1 '柳清风' LEFT "好啊，我这就起程。"
say 3 '无机道人' LEFT "听好，看你这样子，下山准又要给我丢脸。你去后山伏魔洞，取出伏魔剑，方可下山。"
say 3 '无机道人' LEFT "要取伏魔剑，先得过三关，第一，打开存放宝剑的机关门；第二，打败护剑兽；第三，躲过落石。也该磨练磨练了，去吧。"
say 1 '柳清风' LEFT "请问师父，过这三关要用什么方法？"
say 3 '无机道人' LEFT "这就要靠你自己了。"
say 1 '柳清风' LEFT "是，师父。"
set 2
return

去取剑:
say 3 '无机道人' LEFT "去吧，取了剑回来见我。"
say 1 '柳清风' LEFT "是，师父。"
return

取回伏魔剑:
say 1 '柳清风' RIGHT "师父，弟子已取回宝剑。"
say 3 '无机道人' LEFT "呵呵，取到了是在我预料之中的！怎么样，没事吧。"
say 1 '柳清风' RIGHT "我拔出宝剑时地动山摇的，好象出了大事了，出山洞时还被石头砸伤了手。"
say 3 '无机道人' LEFT "哦，快去包扎一下吧。把剑放在我这里吧。"
@usegoods 14 12 没剑
messagebox "伏魔剑交给了无机子"
say 3 '无机道人' LEFT "你回去收拾，下山去吧。记住，除魔卫道，是你的本分，要以天下苍生为念。"
say 1 '柳清风' RIGHT "是，师父。"
@事件：下山除蛇妖
set 31
return

没剑:
messagebox "没有宝剑"
return

回去收拾下山吧:
say 3 '无机道人' LEFT "你回去收拾，下山去吧。记住，除魔卫道，是你的本分，要以天下苍生为念。"
say 1 '柳清风' RIGHT "是，师父。"
return


三清宫:
loadmap 1 2 12 2 10 7
return

trigger 201 三清宫

trigger 101 师傅
